National_bank_xml/MT910encrypted_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getMt910Request xmlns:ns2="http://strukturaRtgsNaloga.xml.com" xmlns:ns3="http://mt102.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>bjoqU6VzzOKFB0cG7ssNORj5f0gj3TqGZV5pV+kzOGqZXSnWq9IPLxgVvqOJ1Lnl+TMTa2JjdtZe&#13;
4p1TZ3Mn9kKI5WeFojhqNbUDx7+qeNk7bhSvKo5cDFFZ+MsP0n5lmHvOuRT8rXo785ww1j0R40Kk&#13;
G/OMhtb9A/7tjMyrNQw7sQZn3b53Mf3zXEDZA04IGRPg8E8RpmbYB5R+XrvboD1uJrIoC81h3Y8t&#13;
j1LvQzS7FCZqS6r0MHqPzTk31c5PjDe8aLdh/6SUXO4NIQt9GUL+B0kgNeK7x6XsxJOaERFdEEy1&#13;
4vv0oX21eVVmHhO2SDAe/b5eZdciuPcX7vLnIQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>hTZZNGzjJ025U3iEefh9/UOltv61Df72qbn7tqQ9O4Xuw+XJiLrBj9fN+XcE0e62y7kvvCcAWw2q&#13;
tdov/CWZBu35irg7qMhPl1G3w3cWC8t3PjUgwW/OpAOneGhAuG96vXu6yTPXKSG8Pzr9pnoCYsnL&#13;
AkVjqxLOOdxVqmvOzKWXECth64iH0ukEu7AketHSwcRkTh6Y0JdVu0OJrWMc7fOI9CegUiu542aY&#13;
UB2fc7Cn5FuF/eiCcgnNc5S/tXVl4N6mDSKeog+Zspa3ixNiXwZHXmE7cIunDeU9W2VoPe1vQo2t&#13;
tQtjIn6TaDO5nsOQT4BAxbk6sBZPKKr36vcERMAaMa/QYBNfDb70r106sSNHcbe67JLchm/8MZzQ&#13;
uGt0t7fBo6sOu9ybDPQx5sUlxgL16y5PQ2lfp0QP5l/qsr0+AG+Y7GzEbWObuhAlIGKmMEoXX+HN&#13;
VIfV++Y2NBE1SvrMfUgoxFC6PaDtMtIdGsaZx0BBsgHSw7HYP2AEuQjhsg7o2qVC86IyA+eYLVxp&#13;
+u5g6MqGExcvMcCzFYj8XH3dwzS6l90HZoZ6FWhIHpqHrTWXNYzMPfnMst9i4sykSdbndn1BiebB&#13;
PJZjnqN3hUao3hq1UJ2PmK2g9nv8cgLFXzu1P5RWcDEshuMUjyDb8CK4iqmxs8ZcdpOMTTxN9zJN&#13;
X5AaqBA5WTZpT/L26zOWDCTM/g6ux192HKQdyJ3aJZk+TswV5isgdj4gwUdUmdXvxCsskA1vl2wK&#13;
f0Wgy7pVrRxBLcvaKFjth9ZNa7RphlLvMfMYT3KRa6Hpj/j0N1DVEYznza+gP16CxjvIhHsHA4FF&#13;
bMSVyH8edDZNNrLC+xE+f0Q4rNo1ps9Cw7dMrI1trgEiwRIOy2OfU+yV+3HUgZ5bdYB33CFpCFCd&#13;
L1++iBS9KlK9QrE7/+4FecKh/eWJWC2bmkoqd2vaD4QKuT5+yWI3DMHhdvLz+j6hrrP08hy+kQfe&#13;
LMf9OGrPCZRp2fLq4ivthzrpwE9JLNVc/AKdBwtbJ5SLRGlh9NDD29AO2nasLfKSuy31qH7Rcm1h&#13;
2597fIn0+vHpFGzy6C+tXUN+N0ikHaekOqqK9uPMMywDAWBGPWICS3fvSVrmVz67JzueazJAdE9F&#13;
iVw3ABQJU5ToYF1XQQ4eWouIziILfizpM+g6s4laIv7M7EiuYBkB0dq91NeraFClPQ8Rw7M/RyCd&#13;
1wP+EMW6cWOJzcqO10LlsqjyNH3cUMFwl3gXhfSKj/tl/9U98Uq7pu5wM/JQabcNyvzu+9F0v38E&#13;
3DdPNgjGwx86exS1c6BmVB9LEoaV48DGOv85BFrxiGOJg3y3JrwsLe+Sn7n3kTeH5LSehwMWTlZg&#13;
2ptFZOQRQeYgAa/X5AH/xlR9fHGc7383uVhepkpcFx4jPxYhx349P2YO6Vge5QrlAcpuxxsnL6jH&#13;
c9A29qRG1leDnaHMsSmf+TEpJ0yaQzdYRCNwEusLNOP1cDIJVfS3Pc4ZtSbMptcXCFJL+J4np+Vr&#13;
QamY9L3QqnmvYn5Diry1+QL25qM8sGJmqF7X4iC5LtsNccBBVgaxibtoxPmYJuNahsrCKcJjgIsa&#13;
49KANIW9dXRa8y6pjOckpDGmVzWW/+pRx+Bk1c2UJjpphyTk8XfXL7Q8MsOT60bfHWl5qi7Y+J4M&#13;
WJ6IbUwQ7rvs/ULtkvBvgfXT8VXwHKbGrs0tfy2PWmRRLIoOuOLHMo/Ar7JQ7PQgj+evi3t6T5CX&#13;
47F9p8F4DPoL2pMGXd0eWlM=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getMt910Request></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>O5wplb4yfDUEWC2Wj8Hpjm67JQw=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
MizSwyiEqlcHRo4s18Tnv66WzpOguirZoN8sczqk4+w9qIAU7rnPNrLqPbhMM/5uT67mN2U9pGln&#13;
aXqOqpjiAfRiImDYdLI+hI45y8E+yEuqhnuvrJJPxbb27UFudZ9ERf3Q6WIEyID6qQGGQyg3DyhE&#13;
mVZ8qkVkH51G//JmkDvjhnopYQqSfR/o0Fpgq2ggr9LjCjzK1nN0MOmJ5gOB15Wsc9/ti5COBDRB&#13;
YWTfdV6pP3ejeraFGWS1AVvsgbhknLL39mfpV1dHomjLzCFRN4iC5ETYDbD5+ftu4eNWXP5Y3aTV&#13;
BjnoCvz/RRV58dXhXfFOyK9cjx2Ne6nKgcbJPA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iB4brM9IcSzO94vsP2oklqN2bnPRIj4WnkokiLR4pwUiZPDwNOmz8VXfq73I6HA1++WGYMTxBwwi&#13;
YTWlCvBBGoN/iKQNY31bk/8ybvHCH+jfLuMe6LGkOzqiXKOARR+13D4/55JmhGIry6ZaUHNnBEQw&#13;
oO9I30t90tLf+t2+AJUes1cRv8bbXtkoiykA4ZGdT+xaB8t41LIdNIRFNYaupGQPs3td7xZn7kJd&#13;
nEv2KIma8gOlDDkr8M2TARRmbcLSsr4MPXosIalThZE8Nt5l/zRQiRM9pSW2zAVAqQ/frLf8ZZuS&#13;
TQwy1wt+OJ4DX+DVcya9ONNRNXvfCMGyxdheyw==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDyDCCArCgAwIBAgIEWUhQjjANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjCBlDEWMBQGA1UE&#13;
AwwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2Ru&#13;
YSBiYW5rYTEMMAoGA1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEa&#13;
MBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0MzgwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB&#13;
AQCIHhusz0hxLM73i+w/aiSWo3Zuc9EiPhaeSiSItHinBSJk8PA06bPxVd+rvcjocDX75YZgxPEH&#13;
DCJhNaUK8EEag3+IpA1jfVuT/zJu8cIf6N8u4x7osaQ7OqJco4BFH7XcPj/nkmaEYivLplpQc2cE&#13;
RDCg70jfS33S0t/63b4AlR6zVxG/xtte2SiLKQDhkZ1P7FoHy3jUsh00hEU1hq6kZA+ze13vFmfu&#13;
Ql2cS/YoiZryA6UMOSvwzZMBFGZtwtKyvgw9eiwhqVOFkTw23mX/NFCJEz2lJbbMBUCpD9+st/xl&#13;
m5JNDDLXC344ngNf4NVzJr0401E1e98IwbLF2F7LAgMBAAGjIDAeMA8GA1UdEwEB/wQFMAMBAf8w&#13;
CwYDVR0PBAQDAgH2MA0GCSqGSIb3DQEBCwUAA4IBAQBKgkCxBNwHmG/wEYU8Od6HkxihXWPj1h12&#13;
fG+q61jmb4fYSRfJ0izYvn5nrXht+WQh/TSDoR5b/FyKbjwyTqT14F+SduxLVKQ2SEdeO/nvHE3r&#13;
nQBV4fRejhZU5tfX6L5axwh33CP+S1BJ/hVzF5q2gctUkL4lCcfvcjk+ybKoi0+d4xuavtHrdfc8&#13;
B3R5xQoJHpWijNLg0JQn76/9gt1GMvBduxBUB1RE32w0+mWlCI1aQEOcM69rXRgRW6BWWP1GyMGr&#13;
YeOsFn5vAOQWf2es2a7JbPdCz78z61ULiljUXSYC60ihwwBCoC0ehlp1itw6xPMtT2xlzvAZ2a+l&#13;
miTA
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>